#include <stdio.h>
#include <stdlib.h>

//2.
void PrintArray(int* a,int n) {
	for (int i = 0; i < n; i++)
	{
		printf("%d\n", a[i]);
	}
}

int main()
{
//-------------------------------------------------------------------------------------------------------------------------
	//1,
	//0~9
	//int a[10] {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};

	//#include <stdlib.h> 추가
	//int n = 10;
	//scanf("%d", &n);

	//int* a = (int*)malloc(n * sizeof(int));
	////void : 형이 정해지지않았다 즉, 바꿀수있다.
	//float* b = (float*)malloc(n * sizeof(float));

	////malloc과 free는 같이쓰게될것임, malloc을 쓰면 hip영역에서 처리를 하는데 free를 해서 해당변수를 해방시켜줘야함. 

	//for (int i = 0; i < n; i++)
	//{
	//	a[i] = i + 1;
	//}

	//for (int i = 0; i < n; i++)
	//{
	//	printf("%d", a[i]);
	//}

	//free(a);
	//free(b);
//-------------------------------------------------------------------------------------------------------------------------
	//2.
	int n = 20;
	//n개만큼의 공간을 동적으로 할당받음
	int* c = (int*)malloc(n * sizeof(int));
	free(c);
	int a[20];
	
	for (int i = 0; i < n; i++)
	{
		a[i] = i + 1;
	}

	PrintArray(a,10);
	PrintArray(a,20);

//-------------------------------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------
	return 0;
}